Catalogs/ИА_БПТочкиМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПТочкиМаршрута</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_БПКартыМаршрутов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыАдресацииЗадач</v8:Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПВариантыДней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммнаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияИстинно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияЛожно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадачВложенногоБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращатьАвторуНаПроверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеЛинии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСобытияТочекБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПВариантыОбработчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыВложенногоБП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСпособыЗаполненияДопРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ИА_БПРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыводимыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчищатьПриСозданииЗадачи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ИА_БПТипыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПТипыТочекМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйБизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПСобытияТочекБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПСобытияТочекБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Условие_ПроверкаУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие_ПриВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеНаименования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеСодержания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаОтветственного</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПВариантыОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПВариантыОбработчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интерактивно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонструкторУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммныйОбработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПТипыАдресацииЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПТипыАдресацииЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаБП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПСпособыЗаполненияДопРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПСпособыЗаполненияДопРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИзменять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Установить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенести</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_БПТочкиМаршрута/Ext/ObjectModule.bsl
Процедура ЗаполнитьСвязанныеРеквизиты() Экспорт
    Если Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие Тогда
        НайдСтрока = Обработчики.Найти(Перечисления.ИА_БПСобытияТочекБП.Условие_ПроверкаУсловия, "Событие");
        ПрограммнаяОбработка = НайдСтрока <> Неопределено
        и НайдСтрока.Обработчик <> Перечисления.ИА_БПВариантыОбработчиков.Нет
        и НайдСтрока.Обработчик <> Перечисления.ИА_БПВариантыОбработчиков.Интерактивно;
    Иначе
        ПрограммнаяОбработка = Ложь;
    КонецЕсли;		
КонецПроцедуры
 
//_____________________________________________________________

Процедура ПередЗаписью(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    
    Если ЗначениеЗаполнено(ДлительностьВыполнения) И НЕ ЗначениеЗаполнено(ВариантДлительности) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не указан ""ВариантДлительности"" в """ + ЭтотОбъект + """!";
        Сообщение.Сообщить(); 
    	Отказ = Истина;
    КонецЕсли; 
    
    Если ЭтоНовый() и НЕ ЗначениеЗаполнено(Ответственный) Тогда
    	Ответственный = Перечисления.ИА_БПТипыАдресацииЗадач.ОтветственныйЗаБП;
    КонецЕсли; 
    
    
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(РеквизитыВложенногоБП
    , "СтрокаТЗ.СпособЗаполнения = Перечисления.ИА_БПСпособыЗаполненияДопРеквизитов.НеИзменять");
    
    
    Если ЭтоУведомление И ЗначениеЗаполнено(ДлительностьВыполнения) Тогда
    	ДлительностьВыполнения = Неопределено;
    КонецЕсли; 
    
    Справочники.ИА_БПТочкиМаршрута.ЗаполнитьЗначенияОбработчиковПоУмолчаниюВТочке(ЭтотОбъект);
    
    Для каждого Стр Из Обработчики Цикл
    	Если Стр.Обработчик <> Перечисления.ИА_БПВариантыОбработчиков.ПрограммныйОбработчик Тогда
        	Стр.Код = "";
        КонецЕсли; 
    КонецЦикла; 
    
    МассивДопустимыхСобытий = Справочники.ИА_БПТочкиМаршрута.ПолучитьМассивСобытий(Тип);
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(Обработчики
    , "Контекст.Найти(СтрокаТЗ.Событие) = Неопределено"
    , МассивДопустимыхСобытий);
    
    ЗаполнитьСвязанныеРеквизиты();
    
    ТЗ = ИсходящиеЛинии.Выгрузить();
    ТЗ.Свернуть("Адрес, Идентификатор, Представление, Вариант");
    
    ИсходящиеЛинии.Загрузить(ТЗ);
    
    ИА_Защита_НФ.ТочкаМаршрута_ОбновитьВарианты(ЭтотОбъект);

    ЛинияДляУсловияИстинно = Неопределено;
    ЛинияДляУсловияЛожно = Неопределено;
    Если Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие И ИсходящиеЛинии.Количество() = 2 Тогда
        Для каждого СтрокаТЧ Из ИсходящиеЛинии Цикл
            Представление = Врег(СокрЛП(СтрокаТЧ.Представление));
        	Если Представление = "ДА" Тогда
            	ЛинияДляУсловияИстинно = СтрокаТЧ.Вариант;
        	ИначеЕсли Представление = "НЕТ" Тогда
            	ЛинияДляУсловияЛожно   = СтрокаТЧ.Вариант;
            КонецЕсли; 
        КонецЦикла;
        
        Если НЕ ЗначениеЗаполнено(ЛинияДляУсловияИстинно) Тогда
            ИА_БФКС.СообщениеОбОшибке("В условие """ + ЭтотОбъект + """ не найдена ветка ""Да"" !", Отказ); 
        КонецЕсли; 
        
        Если НЕ ЗначениеЗаполнено(ЛинияДляУсловияЛожно) Тогда
            ИА_БФКС.СообщениеОбОшибке("В условие """ + ЭтотОбъект + """ не найдена ветка ""Нет"" !", Отказ); 
        КонецЕсли; 
        //////ЛинияДляУсловияЛожно = Неопределено;
        //////Если ПрограммнаяОбработка Тогда
        //////    Если ЗначениеЗаполнено(ЛинияДляУсловияИстинно) И ЛинияДляУсловияИстинно.Владелец <> Ссылка Тогда
        //////        ЛинияДляУсловияИстинно = Неопределено;
        //////    КонецЕсли; 
        //////    
        //////    Если ЗначениеЗаполнено(ЛинияДляУсловияИстинно) Тогда
        //////        Для каждого СтрокаТЗ Из ИсходящиеЛинии Цикл
        //////            Если СтрокаТЗ.Вариант <> ЛинияДляУсловияИстинно Тогда
        //////                ЛинияДляУсловияЛожно = СтрокаТЗ.Вариант;
        //////                Прервать;
        //////            КонецЕсли; 
        //////        КонецЦикла; 
        //////    КонецЕсли; 
        //////Иначе
        //////    ЛинияДляУсловияИстинно = Неопределено;
        //////КонецЕсли; 
    КонецЕсли; 
    
    Обработчики.Сортировать("Событие"); 
    
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(ВыводимыеРеквизиты, "Не ЗначениеЗаполнено(СтрокаТЗ.Реквизит)");
    ИА_БФС.ТЗ_УдалитьДубликаты(ВыводимыеРеквизиты, "Реквизит");
    
    Если Ссылка.ДлительностьВыполнения <> ДлительностьВыполнения
        ИЛИ Ссылка.ВариантДлительности <> ВариантДлительности
        Тогда
        ДополнительныеСвойства.Вставить("ИА_ПересчетБП", Истина);
    КонецЕсли; 
КонецПроцедуры



Процедура ПриЗаписи(Отказ)
    Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
    
    
        
    Если ДополнительныеСвойства.Свойство("ИА_ПересчетБП")
        И ДополнительныеСвойства.ИА_ПересчетБП
        Тогда
        
        Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИА_БПНоситель.Ссылка) КАК Количество
        |ИЗ
        |	БизнесПроцесс.ИА_БПНоситель КАК ИА_БПНоситель
        |ГДЕ
        |	ИА_БПНоситель.ИА_КартаМаршрутаБП = &ИА_КартаМаршрутаБП
        |	И НЕ ИА_БПНоситель.ПометкаУдаления");
        Запрос.УстановитьПараметр("ИА_КартаМаршрутаБП", Владелец);
        Выборка = Запрос.Выполнить().Выбрать();
        Если Выборка.Следующий() Тогда
            Колво = Выборка.Количество;
        Иначе	
            Колво = 0;
        КонецЕсли; 
        Если Колво > 0 Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Изменена длительность выполнения ""точки"". Не забудьте пересчитать плановые даты (Через карту маршрута) !";
            Сообщение.Сообщить(); 
            //БизнесПроцессы.ИА_БПНоситель.ПересчитатьПлановыеДаты(Ссылка);    	
        КонецЕсли; 
    КонецЕсли;      
КонецПроцедуры
